PANDAS PROVIDES BUILT-IN FUNCTIONS TO STATISTICALLY INVESTIGATE THE DATA .LET'S CHECK OUT SOME IMPORTANT ONES!

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
list1 = [[1,2,np.nan,4],[np.nan,11,6,9]]
df= DataFrame(list1,index=['row1','row2'],columns=['col1','col2','col3','col4'])
df

      col1  col2  col3  col4
row1   1.0     2   NaN     4
row2   NaN    11   6.0     9

In [3]:
df.sum()    #default axis=0 -> on first axis(along rows)

col1     1.0
col2    13.0
col3     6.0
col4    13.0
dtype: float64

In [10]:
df.sum(axis=1)  #on the second axis

row1     7.0
row2    26.0
dtype: float64

In [11]:
df.min()   #default axis=0(along rows)

col1    1.0
col2    2.0
col3    6.0
col4    4.0
dtype: float64

In [12]:
df.idxmin()  #gives the index of the min value

col1    row1
col2    row1
col3    row2
col4    row1
dtype: object

In [13]:
df.max(axis=1)  #along columns

row1     4.0
row2    11.0
dtype: float64

In [14]:
df.min()

col1    1.0
col2    2.0
col3    6.0
col4    4.0
dtype: float64

In [15]:
df.describe()

       col1       col2  col3      col4
count   1.0   2.000000   1.0  2.000000
mean    1.0   6.500000   6.0  6.500000
std     NaN   6.363961   NaN  3.535534
min     1.0   2.000000   6.0  4.000000
25%     1.0   4.250000   6.0  5.250000
50%     1.0   6.500000   6.0  6.500000
75%     1.0   8.750000   6.0  7.750000
max     1.0  11.000000   6.0  9.000000

MERGING

MERGING IS ONE OF THE METHODS USED TO JOIN DATAFRAME(MERGING,CONCATENATING,JOINING).

In [18]:
df1 = DataFrame({'col1':np.arange(6),'common':['a','c','b','c','a','b']})
df1

   col1 common
0     0      a
1     1      c
2     2      b
3     3      c
4     4      a
5     5      b

In [33]:
df2 = DataFrame({'col2':np.arange(1,5),'common':['a','m','b','c']})
df2

   col2 common
0     1      a
1     2      m
2     3      b
3     4      c

In [34]:
pd.merge(df1,df2)

   col1 common  col2
0     0      a     1
1     1      c     4
2     2      b     3
3     3      c     4
4     4      a     1
5     5      b     3

In [35]:
pd.merge(df1,df2,on='common')

   col1 common  col2
0     0      a     1
1     1      c     4
2     2      b     3
3     3      c     4
4     4      a     1
5     5      b     3

In [24]:
pd.merge(df1,df2,on='common',how='right')

   col1 common  col2
0   0.0      a     1
1   4.0      a     1
2   NaN      m     2
3   2.0      b     3
4   5.0      b     3

In [36]:
pd.merge(df1,df2,on='common',how='left')

   col1 common  col2
0     0      a     1
1     1      c     4
2     2      b     3
3     3      c     4
4     4      a     1
5     5      b     3

In [37]:
pd.merge(df1,df2,on='common',how='inner')

   col1 common  col2
0     0      a     1
1     1      c     4
2     2      b     3
3     3      c     4
4     4      a     1
5     5      b     3

In [38]:
pd.merge(df1,df2,on='common',how='outer')

   col1 common  col2
0   0.0      a     1
1   4.0      a     1
2   2.0      b     3
3   5.0      b     3
4   1.0      c     4
5   3.0      c     4
6   NaN      m     2

In [39]:
df1

   col1 common
0     0      a
1     1      c
2     2      b
3     3      c
4     4      a
5     5      b

In [40]:
df2

   col2 common
0     1      a
1     2      m
2     3      b
3     4      c